print('Добрий день! Вітаую у конветорі валют')
print('1 - Гривні')
print('2 - Доллари')
while True:
    choice = input('Оберіть валюту з якою ви хочете конвертувати: ')
    if choice == '1':
        print('Ви обрали Гривні')
        a = float(input('Введіть кількість гривень: '))
        print('Гривні:',a,'- Долларів:',a / 37.60)
        break
    elif choice == '2':
        print('Ви обрали Доллари')
        a = float(input('Введіть кількість долларів: '))
        print('Доллари:', a, '- Гривень:', a * 37.60)
        break
    else:
        print('Введено некоретна дія')