a = int(input('Введіть розмір файлу в гігабайтах: '))
b = int(input('Введіть швидкість інтернет-з`єднання в біт/с: '))
print('1 - Порахувати за скільки годин завантажеться файл')
print('2 - Порахувати за скільки хвилин завантажеться файл')
print('3 - Порахувати за скільки секунд завантажеться файл')
choice = input('Оберіть дію: ')
if choice == '1':
    print('Файл завантажеться за', (a*8589934592)/b*3600, 'годин')
elif choice == '2':
    print('Файл завантажеться за', (a*8589934592)/b*60, 'хвилин')
elif choice == '3':
    print('Файл завантажеться за', (a*8589934592)/b, 'секунд')
else:
    print('Невірна дія')